iam-plan:
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.ci will be updated in-place
  ~ resource "aws_iam_policy" "ci" {
        arn         = "arn:aws:iam::587807691409:policy/datagov-terraform"
        description = "Policy allowing access to EC2, RDS, and IAM to automate creation of data.gov environments using terraform in CI."
        id          = "arn:aws:iam::587807691409:policy/datagov-terraform"
        name        = "datagov-terraform"
        path        = "/"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "iam:AddUserToGroup",
                            "iam:AttachGroupPolicy",
                            "iam:AttachUserPolicy",
                            "iam:CreateGroup",
                            "iam:CreatePolicy",
                            "iam:CreatePolicyVersion",
                            "iam:CreateUser",
                            "iam:DeactivateMFADevice",
                            "iam:DeleteAccessKey",
                            "iam:DeleteAccountPasswordPolicy",
                            "iam:DeleteGroup",
                            "iam:DeleteGroupPolicy",
                            "iam:DeleteLoginProfile",
                            "iam:DeletePolicy",
                            "iam:DeletePolicyVersion",
                            "iam:DeleteSSHPublicKey",
                            "iam:DeleteUser",
                            "iam:DeleteUserPolicy",
                            "iam:DeleteVirtualMFADevice",
                            "iam:DetachGroupPolicy",
                            "iam:DetachUserPolicy",
                            "iam:GetAccountPasswordPolicy",
                            "iam:GetGroup",
                            "iam:GetGroupPolicy",
                            "iam:GetPolicy",
                            "iam:GetPolicyVersion",
                            "iam:GetUser",
                            "iam:GetUserPolicy",
                            "iam:ListAccessKeys",
                            "iam:ListAttachedGroupPolicies",
                            "iam:ListAttachedUserPolicies",
                            "iam:ListGroupPolicies",
                            "iam:ListGroups",
                            "iam:ListGroupsForUser",
                            "iam:ListMFADevices",
                            "iam:ListPolicies",
                            "iam:ListPolicyVersions",
                            "iam:ListSSHPublicKeys",
                            "iam:ListUserPolicies",
                            "iam:ListUsers",
                            "iam:ListVirtualMFADevices",
                            "iam:PutGroupPolicy",
                            "iam:PutUserPolicy",
                            "iam:RemoveUserFromGroup",
                            "iam:SetDefaultPolicyVersion",
                            "iam:TagUser",
                            "iam:UntagUser",
                            "iam:UpdateAccountPasswordPolicy",
                            "iam:UpdateGroup",
                            "iam:UpdateUser",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "IamAdmin0"
                    },
                    {
                        Action   = [
                            "dynamodb:ListTables",
                            "dynamodb:ListTagsOfResource",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "TerraformUser0"
                    },
                    {
                        Action   = [
                            "dynamodb:BatchGetItem",
                            "dynamodb:BatchWriteItem",
                            "dynamodb:DeleteItem",
                            "dynamodb:DescribeTable",
                            "dynamodb:GetItem",
                            "dynamodb:PutItem",
                            "dynamodb:Query",
                            "dynamodb:Scan",
                            "dynamodb:UpdateItem",
                            "s3:GetObject",
                            "s3:ListBucket",
                            "s3:PutObject",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:dynamodb:us-east-1:587807691409:table/table/datagov-lock-table/index/*",
                            "arn:aws:dynamodb:us-east-1:587807691409:table/datagov-lock-table",
                            "arn:aws:s3:::datagov-terraform-state",
                        ]
                        Sid      = "TerraformUser1"
                    },
                  ~ {
                      ~ Action   = [
                            "acm:AddTagsToCertificate",
                            "acm:DescribeCertificate",
                            "acm:DeleteCertificate",
                            "acm:ListTagsForCertificate",
                            "acm:RequestCertificate",
                            "acm:UpdateCertificateOptions",
                            "ec2:*",
                            "elasticache:DescribeCacheClusters",
                            "elasticache:DescribeCacheEngineVersions",
                            "elasticache:DescribeCacheParameterGroups",
                            "elasticache:DescribeCacheParameters",
                            "elasticache:DescribeCacheSecurityGroups",
                            "elasticache:DescribeCacheSubnetGroups",
                            "elasticache:DescribeEngineDefaultParameters",
                            "elasticache:DescribeSnapshots",
                            "elasticache:ListAllowedNodeTypeModifications",
                            "elasticache:ListTagsForResource",
                            "elasticache:AddTagsToResource",
                            "elasticache:RemoveTagsToResource",
                            "elasticache:CreateCacheCluster",
                            "elasticache:CreateCacheParameterGroup",
                            "elasticache:CreateCacheSecurityGroup",
                            "elasticache:CreateCacheSubnetGroup",
                            "elasticache:CreateSnapshot",
                            "elasticache:DeleteCacheCluster",
                            "elasticache:DeleteCacheParameterGroup",
                            "elasticache:DeleteCacheSecurityGroup",
                            "elasticache:DeleteCacheSubnetGroup",
                            "elasticache:DeleteSnapshot",
                            "elasticache:ModifyCacheCluster",
                            "elasticache:ModifyCacheParameterGroup",
                            "elasticache:ModifyCacheSubnetGroup",
                            "elasticache:RevokeCacheSecurityGroupIngress",
                            "elasticloadbalancing:*",
                            "rds:*",
                            "route53:ChangeResourceRecordSets",
                            "route53:ChangeTagsForResource",
                            "route53:CreateHostedZone",
                            "route53:DeleteHostedZone",
                            "route53:ListHostedZones",
                            "route53:ListResourceRecordSets",
                            "route53:ListTagsForResource",
                            "route53:ListTagsForResources",
                            "route53:TestDNSAnswer",
                          + "s3:CreateBucket",
                          + "s3:DeleteBucket",
                          + "s3:GetBucketLocation",
                          + "s3:ListBucket",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "AppProvisioning0"
                    },
                    {
                        Action   = [
                            "route53:GetChange",
                            "route53:GetHostedZone",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:route53:::change/*",
                            "arn:aws:route53:::hostedzone/*",
                        ]
                        Sid      = "AppDns0"
                    },
                    {
                        Action   = [
                            "iam:AddRoleToInstanceProfile",
                            "iam:AttachRolePolicy",
                            "iam:CreateInstanceProfile",
                            "iam:CreateRole",
                            "iam:DeleteInstanceProfile",
                            "iam:DeleteRole",
                            "iam:DetachRolePolicy",
                            "iam:GetInstanceProfile",
                            "iam:GetRole",
                            "iam:GetRolePolicy",
                            "iam:ListAttachedRolePolicies",
                            "iam:ListInstanceProfiles",
                            "iam:ListInstanceProfilesForRole",
                            "iam:ListRolePolicies",
                            "iam:PassRole",
                            "iam:PutRolePolicy",
                            "iam:RemoveRoleFromInstanceProfile",
                            "iam:UpdateRole",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:iam::*:instance-profile/*",
                            "arn:aws:iam::*:role/*",
                        ]
                        Sid      = "AppAttachRole0"
                    },
                    {
                        Action   = [
                            "s3:AbortMultipartUpload",
                            "s3:CreateBucket",
                            "s3:DeleteBucket",
                            "s3:DeleteBucketWebsite",
                            "s3:DeleteObject",
                            "s3:DeleteObjectTagging",
                            "s3:DeleteObjectVersion",
                            "s3:DeleteObjectVersionTagging",
                            "s3:GetAccelerateConfiguration",
                            "s3:GetAnalyticsConfiguration",
                            "s3:GetBucketAcl",
                            "s3:GetBucketCORS",
                            "s3:GetBucketLocation",
                            "s3:GetBucketLogging",
                            "s3:GetBucketNotification",
                            "s3:GetBucketPolicy",
                            "s3:GetBucketRequestPayment",
                            "s3:GetBucketTagging",
                            "s3:GetBucketVersioning",
                            "s3:GetBucketWebsite",
                            "s3:GetEncryptionConfiguration",
                            "s3:GetInventoryConfiguration",
                            "s3:GetIpConfiguration",
                            "s3:GetLifecycleConfiguration",
                            "s3:GetMetricsConfiguration",
                            "s3:GetObject",
                            "s3:GetObjectAcl",
                            "s3:GetObjectTagging",
                            "s3:GetObjectTorrent",
                            "s3:GetObjectVersion",
                            "s3:GetObjectVersionAcl",
                            "s3:GetObjectVersionForReplication",
                            "s3:GetObjectVersionTagging",
                            "s3:GetObjectVersionTorrent",
                            "s3:GetReplicationConfiguration",
                            "s3:ListBucket",
                            "s3:ListBucketByTags",
                            "s3:ListBucketMultipartUploads",
                            "s3:ListBucketVersions",
                            "s3:ListMultipartUploadParts",
                            "s3:PutAccelerateConfiguration",
                            "s3:PutAnalyticsConfiguration",
                            "s3:PutBucketCORS",
                            "s3:PutBucketLogging",
                            "s3:PutBucketNotification",
                            "s3:PutBucketRequestPayment",
                            "s3:PutBucketTagging",
                            "s3:PutBucketVersioning",
                            "s3:PutBucketWebsite",
                            "s3:PutEncryptionConfiguration",
                            "s3:PutInventoryConfiguration",
                            "s3:PutIpConfiguration",
                            "s3:PutLifecycleConfiguration",
                            "s3:PutMetricsConfiguration",
                            "s3:PutObject",
                            "s3:PutObjectTagging",
                            "s3:PutObjectVersionTagging",
                            "s3:PutReplicationConfiguration",
                            "s3:ReplicateDelete",
                            "s3:ReplicateObject",
                            "s3:ReplicateTags",
                            "s3:RestoreObject",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::*/*",
                            "arn:aws:s3:::datagov-terraform-state",
                        ]
                        Sid      = "S3Admin0"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

Plan: 0 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------
```


sandbox-plan:
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.inventory.aws_iam_instance_profile.inventory will be created
  + resource "aws_iam_instance_profile" "inventory" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "inventory-sandbox-inventory-profile"
      + path        = "/"
      + role        = "inventory-sandbox-s3-role"
      + roles       = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.inventory.aws_iam_role_policy.inventory is tainted, so must be replaced
-/+ resource "aws_iam_role_policy" "inventory" {
      ~ id     = "inventory-sandbox-s3-role:inventory_s3_policy" -> (known after apply)
        name   = "inventory_s3_policy"
        policy = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "s3:*",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::datagov-appdata-inventory-sandbox",
                            "arn:aws:s3:::datagov-appdata-inventory-sandbox/*",
                        ]
                    },
                    {
                        Action   = "S3:ListAllMyBuckets"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::*"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        role   = "inventory-sandbox-s3-role"
    }

  # module.inventory_2_8.aws_iam_role_policy.inventory will be created
  + resource "aws_iam_role_policy" "inventory" {
      + id     = (known after apply)
      + name   = "inventory_s3_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::datagov-appdata-inventory-2-8-sandbox",
                          + "arn:aws:s3:::datagov-appdata-inventory-2-8-sandbox/*",
                        ]
                    },
                  + {
                      + Action   = "S3:ListAllMyBuckets"
                      + Resource = "arn:aws:s3:::*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "inventory-2-8-sandbox-s3-role"
    }

  # module.inventory.module.s3.aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "datagov-appdata-inventory-sandbox"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.inventory_2_8.module.s3.aws_s3_bucket.default will be created
  + resource "aws_s3_bucket" "default" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "datagov-appdata-inventory-2-8-sandbox"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------
```

